# Specify directory to install
cask_args appdir: "/Applications"

# Tap Homebrew
tap 'homebrew/bundle'
tap 'azure/azd'

# Install packages
brew 'mas'
brew 'tmux'
brew 'node'
brew 'neovim'
brew 'direnv'
brew 'git'
brew 'tree'
brew 'starship'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'azure-cli'
brew 'azd'
brew 'yazi'
brew 'fzf'
brew 'fd'
brew 'zoxide'
brew 'eza'
brew 'bat'
brew 'uv'
brew 'python@3.11'
brew 'openjdk@17'
brew 'maven'
brew 'tfenv'
brew 'trivy'
brew 'lazydocker'
brew 'lazygit'
brew 'kubie'
brew 'kubectx'
brew 'k9s'
brew 'minikube'
brew 'kind'
brew 'helm'
brew 'istioctl'
brew 'bison'
brew 'mage'
brew 'jq'
brew 'pipx'
brew 'yq'
brew 'wget'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-meslo-lg-nerd-font'

# Other apps
cask 'visual-studio-code'

# App Store apps
